############################################################################################################################################################
# if 조건문
##################
# name = input ("당신의 이름은 무엇입니까? : ")
# if name == "이순신" :
#     print("예")
# elif name == "Lee":
#     print("Yes")
# else:
#     print("아니오")
##################
# num = int(input("숫자를 입력해주세요. : "))
# if num % 2 == 0:
#     print("Number is even")
# else:
#     print("Number is odd")
############################################################################################################################################################
#삭제하는법
#remove, del, pop
##################
# a = [1,2,3,4,2]
# a.remove(2) #remove 는 지정 값을 바로 삭제 
# a.pop(1)
# del(a[1])
# del a[1]
# print(a)
############################################################################################################################################################
#calc +,-,*,/
while True:
    print("====================")
    print("*****Calculator*****")
    print("====================")
    print("# 1: Addition")
    print("# 2: Substraction")
    print("# 3: Multiplication")
    print("# 4: Division")
    print("# 5: End")
    print("====================")
    num = input("Your choice (1~5) : ")
    if(num == "1"):
        print("add")
        num1 = int(input("1st Number: "))
        num2 = int(input("2nd Number: "))
        result = num1 + num2
        print("{} + {} = {}".format(num1,num2,result))
    elif(num == "2"):
        print("sub")
        num1 = int(input("1st Number: "))
        num2 = int(input("2nd Number: "))
        result = num1 - num2
        print("{} - {} = {}".format(num1,num2,result))
    elif(num == "3"):
        print("mul")
        num1 = int(input("1st Number: "))
        num2 = int(input("2nd Number: "))
        result = num1 * num2
        print("{} x {} = {}".format(num1,num2,result))
    elif(num == "4"):
        print("div")
        num1 = int(input("1st Number: "))
        num2 = int(input("2nd Number: "))
        result = num1 / num2
        print("{} / {} = {}".format(num1,num2,result))
    elif(num == "5"):
        print("end")
        break
    else:
        print("wrong input")
############################################################################################################################################################
#elif
############################################################################################################################################################
if ():
    pass    #로직이 비어있을때 넣으면 아무것도 처리안하고 넘어가라 
            #안넣으면 오류 
            #나중에 로직을 추가하고 싶을때.. class 같은쪽에 사용하기 좋음
#################################
#함수로 만들면 반복되는게 줄어듬
############################################################################################################################################################
