###################################################
#함수는 가장 위에 선언이 되어 있어야함.. Python은 인터프리터 방식이니까.. 
###################################################
'''
def add(x,y):
    z = x+y
    return z

def msg(m1, m2):
    m3 = m1 + m2
    return m3

a, b = 1,2
r = add(a, b)
print(r, type(r))

c1, c2 = "Good", "Morning"
m = msg(c1, c2)
print(m, type(m))
###################################################
#return 을 안해보는 예제 / 함수를 사용할경우 return(반환)을 꼭 해줘야함.
def msg2(m1):
    m4 = "Hello " + m1
    #return m4

r3 = msg2("Good Day")
print(r3) #return 없으면 None 이 나온다. (값이 없다..)
'''
###################################################
def hello_python():
    print("Hello Python")

hello_python()
###################################################
def sum():
    a = 10
    b = 20
    return a + b #개발자는 이 방법을 선호 : 라인이 하나가 줄어들어서..

c = sum()
print(c)
print(sum()) #한방에 처리가능!!
###################################################
