#복습
# print("{0:d} {2:05d} {1:6d}".format(123, 456, 789))
# x.count('x') / x.find('x') / x.index('x') / x.join('xxx') / x.upper() / x.lower()

#1교시
#비트 연산자 pg: 103~
# & = AND
# | = OR
# ^ = XOR
# ~ = NOT
# << 비트 이동 SHIFT왼쪽
# >> 비트 이동 SHIFT오른쪽 10 진수가 들어가면 2진수로 변환해서 자리이동을 하겠다~
##############################################################################
#String immutable 값이 변경될수 없는
##############################################################################
# str = "Hello"
# #0 1 2 3 4 5
# #-5 -4 -3 -2 -1
# #H e l l o
# print(str[0])
# #str[0] = 1 문자열에서는 값이 변환이 안됨 / 인덱싱 할때
# #del str[0]
# print(str[-1]) #indexing
# print(str[2:]) #slicing
# print(str[-2:])
# print(str[-4:-2])
# print('e' in str)
##############################################################################
#Lists (mutable[값을 변경할수 있는]) [] [] [] []
##############################################################################
# list = [1,2,3,'a']
# print(list[0], list[:2], list[-2:])
# print("%d %d %d %s" % (list[0],list[1],list[2],list[3]))
# print(type(list[3]))
# list[0] = 100
# print(list) #100 으로 변경됨
# del list[0]
# print(list) #100 이 삭제됨
##############################################################################
# list1 = [1,2,3,[4,5,[6,7,8]]] #워낙 많이 사용됨
# print(list1[3])
# print(list1[3][2][0:3]) #list1 에서 0,1,2,3번째가 '4' / 두번째 박스에서 0,1,2 번째가 6 / 3번째 박스에서 슬라이싱으로 다 보여주기 
# list2 = [[1,2,3],[4,5,6],[7,8,9]]
# print(list2[:2][0])
# print(len(list2))
# list2.append(["여기가추가됨",1,1,2,2]) #끝에 요소 추가 해주는것
# print(list2)
# list2.insert(0, ['삽입',1,1])
# print(list2)
##############################################################################
#POP 순차적으로 리스트 요소 뽑아내면서 기존 리스트는 소멸
##############################################################################
##############################################################################
#tuple 튜플은 리스트와 같지만 (다른점: immutable 바꿀수 없다) () () () () 
##############################################################################
tuple1 = (1,2,3,'a')
print(tuple1)
print(tuple1[0], tuple1[-1], tuple1[:2])
###지원 안되는 항목###
#del tuple1[0] 지원 안됨
#tuple1[0] = (1,2,3) 지원 안됨
data1 = [(1, 'john', 20), (2, 'Tom', 22), (3, 'Susan', 30)] #복합적으로 들어갈 수 있다.
print(data1)
##############################################################################
aa = []
for i in range (0, 100) :
    aa.append(0)
print(len(aa))
#print(aa)

#이거 새로로 나오는법 2차원으로 보이는법 알아보기
tt1 = ((1,2,3),(4,5,6),(7,8,9))
print(tt1)